app/controllers/groups_controller.rb

INSERT INTO "groups" ("created_at", "desc", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 30 Jan 2014 18:08:08 UTC +00:00], ["desc", "Chennai Room mates"], ["name", "Room mates"], ["updated_at", Thu, 30 Jan 2014 18:08:08 UTC +00:00]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save