app/controllers/home_controller.rb

  def index
    id = 1.to_s
    @name = 'Mohamed Abubakker Siddhiq'
    @group_list = Group.all
    @transactions = Transaction.where(user_id: id)
---
SELECT "groups".* FROM "groups"
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = 1