app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("amount", "comments", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["amount", 1000], ["comments", "initial"], ["created_at", Thu, 30 Jan 2014 18:09:00 UTC +00:00], ["updated_at", Thu, 30 Jan 2014 18:09:00 UTC +00:00], ["user_id", 1]]