app/controllers/types_controller.rb

  def index
    @types = Type.all
---
SELECT "types".* FROM "types"

  def create
    @type = Type.new(type_params)

    respond_to do |format|
      if @type.save
---
INSERT INTO "types" ("created_at", "desc", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 30 Jan 2014 18:07:30 UTC +00:00], ["desc", "Internet Bill"], ["name", "Internet"], ["updated_at", Thu, 30 Jan 2014 18:07:30 UTC +00:00]]

    def set_type
      @type = Type.find(params[:id])
---
SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", "1"]]